package com.example.listview5

import android.os.Bundle
import androidx.activity.enableEdgeToEdge
import androidx.appcompat.app.AppCompatActivity
import androidx.core.view.ViewCompat
import androidx.core.view.WindowInsetsCompat
import androidx.recyclerview.widget.LinearLayoutManager
import com.example.listview5.databinding.ActivityMainBinding

class MainActivity : AppCompatActivity() {
    private lateinit var binding: ActivityMainBinding
    private lateinit var newsAdapter: NewsAdapter

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        enableEdgeToEdge()
        binding = ActivityMainBinding.inflate(layoutInflater)
        setContentView(binding.root)

        val newsList = listOf<News>(
            News(
                "আবারও ধর্মঘটে চট্টগ্রাম বন্দরে অচলাবস্থা",
                "নিউমুরিং কনটেইনার টার্মিনাল (এনসিটি) বিদেশি প্রতিষ্ঠান ডিপি ওয়ার্ল্ডকে ইজারা দেওয়ার প্রক্রিয়া বাতিলসহ চার দাবিতে আবারও অচল হয়ে পড়েছে দেশের প্রধান সমুদ্রবন্দর চট্টগ্রাম।",
                R.drawable.news1
            ),
            News(
                "ভোটের দিন ২৪ ঘণ্টা যেসব যান চলাচলে নিষেধাজ্ঞা",
                "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট উপলক্ষে সারা দেশে যান চলাচলের ওপর বিধিনিষেধ আরোপ করে প্রজ্ঞাপন জারি করেছে সড়ক পরিবহন ও মহাসড়ক বিভাগ।",
                R.drawable.news2
            ),
            News(
                "আবারও ধর্মঘটে চট্টগ্রাম বন্দরে অচলাবস্থা",
                "নিউমুরিং কনটেইনার টার্মিনাল (এনসিটি) বিদেশি প্রতিষ্ঠান ডিপি ওয়ার্ল্ডকে ইজারা দেওয়ার প্রক্রিয়া বাতিলসহ চার দাবিতে আবারও অচল হয়ে পড়েছে দেশের প্রধান সমুদ্রবন্দর চট্টগ্রাম।",
                R.drawable.news1
            ),
            News(
                "ভোটের দিন ২৪ ঘণ্টা যেসব যান চলাচলে নিষেধাজ্ঞা",
                "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট উপলক্ষে সারা দেশে যান চলাচলের ওপর বিধিনিষেধ আরোপ করে প্রজ্ঞাপন জারি করেছে সড়ক পরিবহন ও মহাসড়ক বিভাগ।",
                R.drawable.news2
            ),
            News(
                "আবারও ধর্মঘটে চট্টগ্রাম বন্দরে অচলাবস্থা",
                "নিউমুরিং কনটেইনার টার্মিনাল (এনসিটি) বিদেশি প্রতিষ্ঠান ডিপি ওয়ার্ল্ডকে ইজারা দেওয়ার প্রক্রিয়া বাতিলসহ চার দাবিতে আবারও অচল হয়ে পড়েছে দেশের প্রধান সমুদ্রবন্দর চট্টগ্রাম।",
                R.drawable.news1
            ),
            News(
                "ভোটের দিন ২৪ ঘণ্টা যেসব যান চলাচলে নিষেধাজ্ঞা",
                "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট উপলক্ষে সারা দেশে যান চলাচলের ওপর বিধিনিষেধ আরোপ করে প্রজ্ঞাপন জারি করেছে সড়ক পরিবহন ও মহাসড়ক বিভাগ।",
                R.drawable.news2
            ),
            News(
                "আবারও ধর্মঘটে চট্টগ্রাম বন্দরে অচলাবস্থা",
                "নিউমুরিং কনটেইনার টার্মিনাল (এনসিটি) বিদেশি প্রতিষ্ঠান ডিপি ওয়ার্ল্ডকে ইজারা দেওয়ার প্রক্রিয়া বাতিলসহ চার দাবিতে আবারও অচল হয়ে পড়েছে দেশের প্রধান সমুদ্রবন্দর চট্টগ্রাম।",
                R.drawable.news1
            ),
            News(
                "ভোটের দিন ২৪ ঘণ্টা যেসব যান চলাচলে নিষেধাজ্ঞা",
                "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট উপলক্ষে সারা দেশে যান চলাচলের ওপর বিধিনিষেধ আরোপ করে প্রজ্ঞাপন জারি করেছে সড়ক পরিবহন ও মহাসড়ক বিভাগ।",
                R.drawable.news2
            ),
            News(
                "আবারও ধর্মঘটে চট্টগ্রাম বন্দরে অচলাবস্থা",
                "নিউমুরিং কনটেইনার টার্মিনাল (এনসিটি) বিদেশি প্রতিষ্ঠান ডিপি ওয়ার্ল্ডকে ইজারা দেওয়ার প্রক্রিয়া বাতিলসহ চার দাবিতে আবারও অচল হয়ে পড়েছে দেশের প্রধান সমুদ্রবন্দর চট্টগ্রাম।",
                R.drawable.news1
            ),
            News(
                "ভোটের দিন ২৪ ঘণ্টা যেসব যান চলাচলে নিষেধাজ্ঞা",
                "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট উপলক্ষে সারা দেশে যান চলাচলের ওপর বিধিনিষেধ আরোপ করে প্রজ্ঞাপন জারি করেছে সড়ক পরিবহন ও মহাসড়ক বিভাগ।",
                R.drawable.news2
            ),
            News(
                "আবারও ধর্মঘটে চট্টগ্রাম বন্দরে অচলাবস্থা",
                "নিউমুরিং কনটেইনার টার্মিনাল (এনসিটি) বিদেশি প্রতিষ্ঠান ডিপি ওয়ার্ল্ডকে ইজারা দেওয়ার প্রক্রিয়া বাতিলসহ চার দাবিতে আবারও অচল হয়ে পড়েছে দেশের প্রধান সমুদ্রবন্দর চট্টগ্রাম।",
                R.drawable.news1
            ),
            News(
                "ভোটের দিন ২৪ ঘণ্টা যেসব যান চলাচলে নিষেধাজ্ঞা",
                "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট উপলক্ষে সারা দেশে যান চলাচলের ওপর বিধিনিষেধ আরোপ করে প্রজ্ঞাপন জারি করেছে সড়ক পরিবহন ও মহাসড়ক বিভাগ।",
                R.drawable.news2
            ),
            News(
                "আবারও ধর্মঘটে চট্টগ্রাম বন্দরে অচলাবস্থা",
                "নিউমুরিং কনটেইনার টার্মিনাল (এনসিটি) বিদেশি প্রতিষ্ঠান ডিপি ওয়ার্ল্ডকে ইজারা দেওয়ার প্রক্রিয়া বাতিলসহ চার দাবিতে আবারও অচল হয়ে পড়েছে দেশের প্রধান সমুদ্রবন্দর চট্টগ্রাম।",
                R.drawable.news1
            ),
            News(
                "ভোটের দিন ২৪ ঘণ্টা যেসব যান চলাচলে নিষেধাজ্ঞা",
                "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট উপলক্ষে সারা দেশে যান চলাচলের ওপর বিধিনিষেধ আরোপ করে প্রজ্ঞাপন জারি করেছে সড়ক পরিবহন ও মহাসড়ক বিভাগ।",
                R.drawable.news2
            ),
            News(
                "আবারও ধর্মঘটে চট্টগ্রাম বন্দরে অচলাবস্থা",
                "নিউমুরিং কনটেইনার টার্মিনাল (এনসিটি) বিদেশি প্রতিষ্ঠান ডিপি ওয়ার্ল্ডকে ইজারা দেওয়ার প্রক্রিয়া বাতিলসহ চার দাবিতে আবারও অচল হয়ে পড়েছে দেশের প্রধান সমুদ্রবন্দর চট্টগ্রাম।",
                R.drawable.news1
            ),
            News(
                "ভোটের দিন ২৪ ঘণ্টা যেসব যান চলাচলে নিষেধাজ্ঞা",
                "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট উপলক্ষে সারা দেশে যান চলাচলের ওপর বিধিনিষেধ আরোপ করে প্রজ্ঞাপন জারি করেছে সড়ক পরিবহন ও মহাসড়ক বিভাগ।",
                R.drawable.news2
            ),
        )

        newsAdapter = NewsAdapter(newsList)
        binding.recyclerView.apply {
            layoutManager = LinearLayoutManager(this@MainActivity)
            adapter = newsAdapter
        }


    }


}